In [1]:
import pandas as pd
import numpy as np

In [6]:
df=pd.DataFrame([[99,np.NaN],[20,15],[101,np.NaN],[np.NaN,502],[np.NaN,77]])
df.columns=['A','B']
df

       A      B
0   99.0    NaN
1   20.0   15.0
2  101.0    NaN
3    NaN  502.0
4    NaN   77.0

In [9]:
dfB=df['B']
dfB

0      NaN
1     15.0
2      NaN
3    502.0
4     77.0
Name: B, dtype: float64

## Drop Null Values

In [10]:
dfB.dropna()

1     15.0
3    502.0
4     77.0
Name: B, dtype: float64

In [12]:
dfdrop=df.dropna()
dfdrop

      A     B
1  20.0  15.0

## Filling Value in NaN

In [13]:
dfB

0      NaN
1     15.0
2      NaN
3    502.0
4     77.0
Name: B, dtype: float64

In [14]:
dfB.fillna(value=100)

0    100.0
1     15.0
2    100.0
3    502.0
4     77.0
Name: B, dtype: float64

In [15]:
df.fillna(value=0)

       A      B
0   99.0    0.0
1   20.0   15.0
2  101.0    0.0
3    0.0  502.0
4    0.0   77.0

##  Fill specific values by column

In [24]:
newdf=df.fillna(value={'A':50,'B':150})
newdf

       A      B
0   99.0  150.0
1   20.0   15.0
2  101.0  150.0
3   50.0  502.0
4   50.0   77.0

In [19]:
df

       A      B
0   99.0    NaN
1   20.0   15.0
2  101.0    NaN
3    NaN  502.0
4    NaN   77.0

## Replace Value

In [22]:
df.replace(np.NaN,55)

       A      B
0   99.0   55.0
1   20.0   15.0
2  101.0   55.0
3   55.0  502.0
4   55.0   77.0

In [26]:
df.replace(20,30) ## 20 in column A is replaced with 30

       A      B
0   99.0    NaN
1   30.0   15.0
2  101.0    NaN
3    NaN  502.0
4    NaN   77.0

## Finding Missing Value

In [28]:
df['B'].isna()

0     True
1    False
2     True
3    False
4    False
Name: B, dtype: bool

In [29]:
df.isna()

       A      B
0  False   True
1  False  False
2  False   True
3   True  False
4   True  False

In [30]:
df.isnull()

       A      B
0  False   True
1  False  False
2  False   True
3   True  False
4   True  False

## Finding NoNMissing Value

In [33]:
df['A'].notnull()

0     True
1     True
2     True
3    False
4    False
Name: A, dtype: bool

In [34]:
df.notna()

       A      B
0   True  False
1   True   True
2   True  False
3  False   True
4  False   True

In [35]:
df.notnull()

       A      B
0   True  False
1   True   True
2   True  False
3  False   True
4  False   True